# IsValidAccuracy Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FormatOptions..::..IsValidAccuracy Method
FormatOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidAccuracy(Double) | Checks whether an accuracy is valid for the display unit in this FormatOptions. |
| IsValidAccuracy(ForgeTypeId, Double) | Checks whether an accuracy is valid for a given unit. |

# See Also
FormatOptions Class
FormatOptions Members
Autodesk.Revit.DB Namespace